cases/OpenFOAM/incompressible/simpleFoam/simpleCar/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (10 0 0);

// Surface normal with time ramping
intakeType1
{
    type            surfaceNormalFixedValue;
    refValue        uniform 1.2;
    ramp            table ((0 0) (10 1));
}

// Uniform surface normal with Function1 for ramping
intakeType2
{
    type            uniformNormalFixedValue;
    uniformValue    table ((0 0) (10 1.2));
}

// Uniform surface normal with time ramping
intakeType3
{
    // Or directly with uniform value (ramping also possible)
    type            uniformNormalFixedValue;
    uniformValue    constant 1.2;
    ramp            table ((0 0) (10 1));
}


boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    airIntake
    {
        $intakeType1;
    }

    outlet
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
    }

    "(body|upperWall|lowerWall)"
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    frontAndBack
    {
        type            empty;
    }
}


#remove "intakeType.*"


// ************************************************************************* //
